app/controllers/bookmarks_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @list = List.find(params[:list_id])

INSERT INTO "bookmarks" ("comment", "movie_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "Good film"], ["movie_id", 353], ["list_id", 2], ["created_at", "2024-09-27 11:14:25.184824"], ["updated_at", "2024-09-27 11:14:25.184824"]]
---
  def create
    @bookmark = Bookmark.new(bookmark_params)
    @bookmark.list = @list
    if @bookmark.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_list
    @list = List.find(params[:list_id])